OdDAI.EntityExtent.append(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Appends an OdDAIObjectId to the Entity Extent.

OdDAI.EntityExtent.refresh(OdHandleTree!System.Runtime.CompilerServices.IsConst*)
\details
Updates a folder content in accordance to owning Model Contents changes since previous refresh.
\remarks
This method works only when Entity Extent Interactive Mode is turned on.

OdDAI.EntityExtent.clear
\details
Clear the content of Entity Extent.

OdDAI.EntityExtent.definition(OdSmartPtr&lt;OdDAI.Entity&gt;)
\details
Sets the entity definition of this entity extent container (folder).
\param definition [in] An entity definition that is the parent definition for all entity instances contained in this entity extent.

OdDAI.EntityExtent.getInstancesOf(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves all instances from extents which are instances of provided entity type definition.
\param entityDef [in] Pointer to an entity definition.
\returns An array of object identifiers of instances of a type.

OdDAI.EntityExtent.getInstancesOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves all instances from extents which are instances of provided entity type name.
\param entityName [in] Entity name.
\returns An array of object identifiers of instances of a type.

OdDAI.EntityExtent.load
\details
Loads all entities from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code.

OdDAI.EntityExtent.unload
\details
Unloads all entities from this entity extent container.
\returns Returns eOk if success, otherwise it should return an error code.

OdDAI.EntityExtent.name
\details
Returns the type name of the entity definition of this entity extent.
\returns
String containing the type name of the entity definition.

OdDAI.EntityExtent.definition
\details
Returns a smart pointer to the entity definition of this entity extent.
\returns
Smart pointer to the entity definition.

OdDAI.EntityExtent.instances
\details
Returns an aggregate of object ids of entity instances for the folder.
\returns
Reference to a set of object ids of entity instances for the folder.

OdDAI.EntityExtent
\details
This class represents a container (folder) that contains entities that
are a certain schema entity type.